'''
Напишите счетчик с помощью конструкции while, который выводит числа от 0 до 10.
Напишите счетчик с помощью конструкции while, который выводит числа от 20 до 1.
'''
n=0
while n<=10:
    print(n)
    n+=1
while n>-9:
    print(n+9)
    n-=1